jebentancour/topsulin/nRF5_SDK_12.3.0/components/ble/ble_services/ble_gls/ble_gls.c
    p_encoded_buffer[len++] = p_meas->flags;

    len += uint16_encode(p_meas->sequence_number, &p_encoded_buffer[len]);
    len += ble_date_time_encode(&p_meas->base_time, &p_encoded_buffer[len]);

    if (p_meas->flags & BLE_GLS_MEAS_FLAG_TIME_OFFSET)
    {
        len += uint16_encode(p_meas->time_offset, &p_encoded_buffer[len]);
    }

    if (p_meas->flags & BLE_GLS_MEAS_FLAG_CONC_TYPE_LOC)
    {
        uint16_t encoded_concentration;

        encoded_concentration = ((p_meas->glucose_concentration.exponent << 12) & 0xF000) |
                                ((p_meas->glucose_concentration.mantissa <<  0) & 0x0FFF);

        p_encoded_buffer[len++] = (uint8_t)(encoded_concentration);
        p_encoded_buffer[len++] = (uint8_t)(encoded_concentration >> 8);
        p_encoded_buffer[len++] = (p_meas->sample_location << 4) | (p_meas->type & 0x0F);
    }

    if (p_meas->flags & BLE_GLS_MEAS_FLAG_SENSOR_STATUS)
    {
        len += uint16_encode(p_meas->sensor_status_annunciation, &p_encoded_buffer[len]);
    }

    return len;
}


/**@brief Function for encoding a Glucose measurement context.
 *
 * @param[in]  p_rec            Record to be encoded.
 * @param[out] p_encoded_buffer  Pointer to buffer where the encoded measurement context is to be stored.
 *
 * @return Size of encoded measurement context.
 */
static uint8_t gls_meas_context_encode(const ble_gls_rec_t * p_rec, uint8_t * p_encoded_buffer)
{
    uint8_t len = 0;

    p_encoded_buffer[len++] = p_rec->context.flags;

    len += uint16_encode(p_rec->meas.sequence_number, &p_encoded_buffer[len]);

    if (p_rec->context.flags & BLE_GLS_CONTEXT_FLAG_EXT)
    {
        p_encoded_buffer[len++] = p_rec->context.extended_flags;
    }

    if (p_rec->context.flags & BLE_GLS_CONTEXT_FLAG_CARB)
    {
        p_encoded_buffer[len++] = p_rec->context.carbohydrate_id;

        uint16_t encoded_units;

        encoded_units = ((p_rec->context.carbohydrate.exponent << 12) & 0xF000) |
                        ((p_rec->context.carbohydrate.mantissa <<  0) & 0x0FFF);

        p_encoded_buffer[len++] = (uint8_t)(encoded_units);
        p_encoded_buffer[len++] = (uint8_t)(encoded_units >> 8);
    }

    if (p_rec->context.flags & BLE_GLS_CONTEXT_FLAG_MEAL)
    {
        p_encoded_buffer[len++] = p_rec->context.meal;
    }

    if (p_rec->context.flags & BLE_GLS_CONTEXT_FLAG_TESTER)
    {
        p_encoded_buffer[len++] = p_rec->context.tester_and_health;
    }

    if (p_rec->context.flags & BLE_GLS_CONTEXT_FLAG_EXERCISE)
    {
        len += uint16_encode(p_rec->context.exercise_duration, &p_encoded_buffer[len]);
        p_encoded_buffer[len++] = p_rec->context.exercise_intensity;
    }

    if (p_rec->context.flags & BLE_GLS_CONTEXT_FLAG_MED)
    {
        p_encoded_buffer[len++] = p_rec->context.medication_id;

        uint16_t encoded_units;

        encoded_units = ((p_rec->context.medication.exponent << 12) & 0xF000) |
                        ((p_rec->context.medication.mantissa <<  0) & 0x0FFF);

        p_encoded_buffer[len++] = (uint8_t)(encoded_units);
        p_encoded_buffer[len++] = (uint8_t)(encoded_units >> 8);
    }

    if (p_rec->context.flags & BLE_GLS_CONTEXT_FLAG_HBA1C)
    {
        len += uint16_encode(p_rec->context.hba1c, &p_encoded_buffer[len]);
    }

    return len;
}


/**@brief Function for adding the characteristic for a glucose measurement.
 *
 * @param[in] p_gls  Service instance.
 *
 * @return NRF_SUCCESS if characteristic was successfully added, otherwise an error code.
 */
static uint32_t glucose_measurement_char_add(ble_gls_t * p_gls)
{
    ble_gatts_char_md_t char_md;
    ble_gatts_attr_md_t cccd_md;
    ble_gatts_attr_t    attr_char_value;
    ble_uuid_t          ble_uuid;
    ble_gatts_attr_md_t attr_md;
    ble_gls_rec_t       initial_gls_rec_value;
    uint8_t             encoded_gls_meas[MAX_GLM_LEN];
    uint8_t             num_recs;
    memset(&cccd_md, 0, sizeof(cccd_md));

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_ENC_NO_MITM(&cccd_md.write_perm);
    cccd_md.vloc = BLE_GATTS_VLOC_STACK;

    memset(&char_md, 0, sizeof(char_md));

    char_md.char_props.notify = 1;
    char_md.p_char_user_desc  = NULL;
    char_md.p_char_pf         = NULL;
    char_md.p_user_desc_md    = NULL;
    char_md.p_cccd_md         = &cccd_md;
    char_md.p_sccd_md         = NULL;

    BLE_UUID_BLE_ASSIGN(ble_uuid, BLE_UUID_GLUCOSE_MEASUREMENT_CHAR);
    memset(&attr_md, 0, sizeof(attr_md));

    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&attr_md.write_perm);

    attr_md.vloc    = BLE_GATTS_VLOC_STACK;
    attr_md.rd_auth = 0;
    attr_md.wr_auth = 0;
    attr_md.vlen    = 1;

    memset(&attr_char_value, 0, sizeof(attr_char_value));
    memset(&initial_gls_rec_value, 0, sizeof(initial_gls_rec_value));

    num_recs = ble_gls_db_num_records_get();
    if (num_recs > 0)
    {
        uint32_t err_code = ble_gls_db_record_get(num_recs - 1, &initial_gls_rec_value);
        if (err_code != NRF_SUCCESS)
        {
            return err_code;
        }
    }

    attr_char_value.p_uuid    = &ble_uuid;
    attr_char_value.p_attr_md = &attr_md;
    attr_char_value.init_len  = gls_meas_encode(&initial_gls_rec_value.meas, encoded_gls_meas);
    attr_char_value.init_offs = 0;
    attr_char_value.max_len   = MAX_GLM_LEN;
    attr_char_value.p_value   = encoded_gls_meas;

    return sd_ble_gatts_characteristic_add(p_gls->service_handle,
                                           &char_md,
                                           &attr_char_value,
                                           &p_gls->glm_handles);
}

/**@brief Function for adding the characteristic for a glucose measurement context.
 *
 * @param[in] p_gls  Service instance.
 *
 * @return NRF_SUCCESS if characteristic was successfully added, otherwise an error code.
 */
static uint32_t glucose_measurement_context_char_add(ble_gls_t * p_gls)
{
    ble_uuid_t          char_uuid;
    BLE_UUID_BLE_ASSIGN(char_uuid, BLE_UUID_GLUCOSE_MEASUREMENT_CONTEXT_CHAR);

    ble_gatts_attr_md_t cccd_md;
    memset(&cccd_md, 0, sizeof(cccd_md));

